package ru.vood.kotkin.rules.ru.vood.kotkin.rules._03_expression

fun main() {
    println("=== ДЕМО if ВЫРАЖЕНИЙ В KOTLIN ===\n")

    // ----------------------------------------------------------------------
    // 1. БАЗОВОЕ ИСПОЛЬЗОВАНИЕ TRY-CATCH КАК ВЫРАЖЕНИЯ
    // ----------------------------------------------------------------------
    println("1. БАЗОВОЕ ИСПОЛЬЗОВАНИЕ if КАК ВЫРАЖЕНИЯ:")

    val result1: String = if (10 % 2 == 0) {
        "на цело"
    } else "дробно"
    println("Результат: $result1")
}